<?php 

$brand = [[
	"Марка" => "Skoda", 
	"Страна_марки" => "Чехия", 
	"Год_основания" => 1900 ],
[
	"Марка" => "Honda", 
	"Страна_марки" => "Япония", 
	"Год_основания" => 1948 ],
[
	"Марка" => "Ford", 
	"Страна_марки" => "США", 
	"Год_основания" => 1903 ]]; 

$car = [[
	"Модель" => "Octavia", 
	"Марка" => "Skoda", 
	"Год_выпуска" => 2018 ],
[
	"Модель" => "Fabia",
	"Марка" => "Skoda",
	"Год_выпуска" => 2017 ],
[
	"Модель" => "Accord", 
	"Марка" => "Honda", 
	"Год_выпуска" => 2016 ],
[
	"Модель" => "Fit",
	"Марка" => "Honda",
	"Год_выпуска" => 2015 ],
[
	"Модель" => "Oddysey",
	"Марка" => "Honda",
	"Год_выпуска" => 2014 ],
[
	"Модель" => "Fiesta",
	"Марка" => "Ford",
	"Год_выпуска" => 2013 ],
[
	"Модель" => "Focus", 
	"Марка" => "Ford", 
	"Год_выпуска" => 2012 ]];

echo "О всех марках: <br>";
for ($j=0; $j < count($brand); $j++)
echo $brand[$j]["Марка"]." - ".$brand[$j]["Страна_марки"]." - ".$brand[$j]["Год_основания"]."<br>"; 
 
    

echo "<br>О всех автомобилях: <br>";
for ($i=0; $i < count($car); $i++) 
for ($j=0; $j < count($brand); $j++) 
if ($car[$i]["Марка"] == $brand[$j]["Марка"]) { 
	echo $car[$i]["Модель"]." - ".$brand[$j]["Марка"]." (".$brand[$j]["Страна_марки"].") - ".$car[$i]["Год_выпуска"]."<br>"; 
} 
?>